# Ο χρήστης εισάγει ένα θετικό ακέραιο αριθμό επαναλήψεων.
# Το πρόγραμμα ξεκινάει από τον αριθμό 0 (προηγούμενος αριθμός) και αυξάνει κατά 1 μέχρι τον αριθμό των επαναλήψεων.
# Σε κάθε επανάληψη τυπώνεται στην οθόνη ο τρέχοντας αριθμός, ο προηγούμενος αριθμός και το άθροισμα του τρέχοντα και του προηγούμενου αριθμού (input, int, range).

def loops(numloop):

    for i in range(0,numloop):
        print("Number: "+str(i)+", Previous Number: "+str(i-1)+", Sum: "+str(i+(i-1)))


numloop = int(input("please enter an interger "))

loops(numloop)


